# Cleaning Done! 

# Get Means, 2 STD and Visualize

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [3]:
Water = pd.read_csv("C:\\Users\\gst8882\\Desktop\\Sea_Height.csv")
Water.head()

   WaterLevel Type      City State  Station                        Date
0       0.442   L   Cape May    NJ  8536110  1979-01-01 08:42:00.000004
1       2.509   HH  Cape May    NJ  8536110  1979-01-01 15:17:59.999996
2       0.378   LL  Cape May    NJ  8536110  1979-01-01 21:11:59.999997
3       2.158   H   Cape May    NJ  8536110  1979-01-02 03:47:59.999999
4       0.405   LL  Cape May    NJ  8536110  1979-01-02 09:47:59.999999

In [4]:
Water['mean'] = Water[['WaterLevel']].mean(axis=1)
Water.head()

   WaterLevel Type      City State  Station                        Date   mean
0       0.442   L   Cape May    NJ  8536110  1979-01-01 08:42:00.000004  0.442
1       2.509   HH  Cape May    NJ  8536110  1979-01-01 15:17:59.999996  2.509
2       0.378   LL  Cape May    NJ  8536110  1979-01-01 21:11:59.999997  0.378
3       2.158   H   Cape May    NJ  8536110  1979-01-02 03:47:59.999999  2.158
4       0.405   LL  Cape May    NJ  8536110  1979-01-02 09:47:59.999999  0.405